wiki/app/controllers/articles_controller.rb

  def create
    @article = Article.new params[:article]
    if @article.save
---
INSERT INTO "articles" ("updated_at", "title", "body", "category_id", "series_id", "author_id", "published_at", "created_at") VALUES('2009-12-30 14:59:47', 'dwqdwdq', 'fewfew', NULL, NULL, NULL, NULL, '2009-12-30 14:59:47')

  def show
    @article = Article.find params[:id]
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)

  def edit
    @article = Article.find params[:id]
---
SELECT * FROM "articles" WHERE ("articles"."id" = 3)

  def update
    @article = Article.find params[:id]
    if @article.update_attributes(params[:article])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 3)
UPDATE "articles" SET "title" = 'うほほおほほほほ', "updated_at" = '2009-12-30 15:39:04' WHERE "id" = 1